const updates = [
    

{
    version: "8/28",
    date: "2026-08-28",
    type: "패치",
    title: "개발자 노트 37",
    new: true,
    content: [
        {
            title: "신규 동료 : [보물 사냥꾼] 선우 나래",
            text: "적속성 보스 특화형 서포터<br><br>패시브 - 패시브 [보물] 스킬은 전투 시작 시 자신과 소환수를 제외한 가장 가까운 아군 1명을 선정하여 보물을 전달합니다. 이 보물은 아군에게 버프를 준다.(중첩가능)<br><br>엑티브1 - [자본주의의 맛] 스킬을 사용하여  금화를 퍼부어 적군에게 적 속성 저항률 감소, 치명타 저항률 감소 등 각종 디버프 부여. 배치된 적 속성 아군이 많을수록 더 많은 금화를 퍼붓는다.<br><br>엑티브2 - [황금빛 휘광]은 보물을 전달한 아군에게 황금빛 휘광을 부여하여 최대 10회까지 중첩되는 버프를 부여하고 타수 보호막까지 생성해서 보물을 지닌 아군을 보호합니다.<br><br>궁극기 - [내 금화!]를 사용하면 모든 아군에게 강력한 보호막을 부여하고 전장 곳곳에 금화를 뿌리게 됩니다. 금화는 적군이 다가오면 폭발하지만 8초 후에는 선우 나래가 다시 금화를 회수하며 회수한 금화 개수에 따라서 더 강력한 버프를 부여합니다.<br><br>선우 나래는 공격속도와 급속, 기본 공격 관통률과 필살기 관통률을 고루 올려주어 기본 공격과 스킬을 고루 사용하는 하이브리드 딜러와 찰떡궁합을 자랑합니다. 특히 앞서 선보인 [13월의 무기] 하유리와 함께 사용해보시면 놀라운 시너지를 경험하실 수 있습니다.",
            images:["images/선우나래.png"]
        },
        {
            title: "9월 16일 출시 [44층의 지배자] 쿤 로얄 엘리엇",
            text: "엘리엇은 황속성 SSR+ 근접형 마법사<br><br>",
            images:["images/엘리엇.png"]
        },
        {
            title: "가주 복각 안내",
            text: "9/2 [가문의 주인] 트로이메라이<br>9/16 [월하익송] 우렉 마지노<br>9/30 [가문의 주인] 구스트앙",
            images:["images/가주 복각.png"]
        },
        {
            title: "트메 상향 & 의상 지급",
            text: "트로이메라이가 모든 스킬을 사용할 때마다 코발트와 크라켄에게 공격 명령을 내리게 되어 특정한 조건이 마련되지 않았더라도 소환수들이 활약할 기회가 많아집니다.<br><br>크라켄과 코발트는 사망에 이르는 대미지를 입을 시 일정 시간 동안 무적이 되며 이 효과는 쿨타임을 가지고 다시 충전되기 때문에 지속적으로 소환수를 보호할 수 있습니다.<br><br>크라켄에게도 에너지 감소 효과가 추가",
            images:["images/트메 의상 복각.png"]
        },
        {
            title: "9월 주요 개선 사항",
            text: "1. 레볼루션 포트 난이도 완화 및 추가 확장<br>- 4-1 ~ 8-10 구간 너프 9-1 ~ 9-10 구역이 새롭게 추가(9/2적용)<br><br>2. 지하실험실 급속 감소 단계 완화<br>- 30단계/60단계/90단계로 가중되던 디버프의 단계 기준을 80단계/120단계/150단계로 변경 예정<br><br>3. 진검승부 리그 편성 기준 변경<br>- 보유한 동료의 결투(PvP)코어 합산이 높은 순으로 정렬하여 선별되는 방식으로 변경됩니다. 여기에, 코어 합산이 동일할 경우 슬롯레벨 합산으로 적용<br><br>4. 기원 천장 보너스 카드 수령 시 선택형으로 개선<br>- 기원 천장 보너스 카드 수령 시 기원 대상 캐릭터 목록 중 원하는 동료를 팝업에서 직접 선택하여 수령할 수 있도록 직관적으로 개선됩니다.(9/16적용)<br><br>5. 시동무기 프리셋 적용 시 PVE, PVP, BOSS 모든 모드에 일괄 적용하는 기능 제공<br>기존 장착 여부와 관계없이 프리셋을 통해 PVE, PVP, BOSS 모든 모드에 시동무기를 즉시 일괄 적용할 수 있도록 개선됩니다.(9/16적용)"
        },
        {
            title: "건의 사항 답변",
            text: "Q. [13월의 무기] 하유리의 실제 성능과 향후 지원 계획을 설명해 주세요.<br>A. 유리 성능 의도한 것이다. 앞으로 나올 서폿들 뽑아라.<br><br>Q. PC버전에 대해 가로 모드를 지원해 주세요.<br>A. 설계 단계부터 세로 모드로 만들었기에 가로모드 추가할 계획이 없다.<br><br>Q. 레볼루션 초기화 티켓 사용 범위를 확장해 주세요.<br>A. 다음엔 가주도 초기화 가능하게 해주겠다.<br><br>Q. 시동무기 영혼 강화 부담과 장비 관리 동선을 개선해 주세요.<br>A. 주사위, 숫돌 수급처 늘려줬고 이제 시무 돌려쓰기 가능하니까 영혼 강화쪽은 개선 안 하겠다.<br><br>Q. 패스 상점과 적립상점 등 상품 가치와 구매 편의를 개선해 주세요.<br>A. 패스 버프 해주겠다.(10/28) 추가적으로 적립상점 구매 제한 늘려주겠다.(9/30)<br><br>Q. 성장 교환 이벤트의 운영을 기존 이벤트와 동일한 형태로 해주세요.<br>A. 다른 이벤트랑 똑같이 2주 동안 진행하게 할 것이며 주년 이벤트 제외하고 가끔 해주겠다.<br><br>Q. 탑에서 살아남기의 연합 미션 난이도를 조정해 주세요.<br>A. 하양하겠다.<br><br>Q. 기록보관실에 성장 콘텐츠 반영을 잘 연계해 주세요.<br>A. 검토해보고 추가해주겠다.<br><br>Q. 캐릭터에 종속된 여러 정보를 한 화면에서 모아볼 수 있도록 개선해 주세요.<br>A. 엮여 있는 부분이 많고 통합 UX를 별도로 설계해야 하는 만큼 다소간의 시간은 걸릴 것으로 예상되지만 해보도록 노력해보겠다.<br><br>Q. 보스 콘텐츠의 패턴을 다양화 해주세요.<br>A. 보스 패턴 다양화 진행 하겠으며 보상 개편할 것이다. 또한 보스 연습모드 추가할 것이다.<br><br>Q. 연합 함대전의 매칭, 참여 피로도, 보상에 대한 개선을 해주세요.<br>A. 해주겠다(10월 중순 업뎃쯤)"
        },
        {
            title: "신규 PvE / BOSS 콘텐츠 ‘성역’과 새로운 성장 시스템 ‘성물’",
            text: "콘텐츠 개방 조건은 하드 모드 300-60 클리어 후<br><br>플레이어가 직접 이동 가능(점령전 같은 느낌일듯)<br><br>보유한 코어에 따라서 난이도 선택 가능하고 난이도 높을 수록 보상이 더 좋다. 또한, 난이도가 올라갈수록 '성물'아이템의 등장 확률이 높다.<br><br>전투에서 패배하더라도 다시 도전이 가능하며, 누적해서 입힌 피해에 따라 추가 보물상자 획득 가능<b><em><strong><br><br>성물은 PVE, PVP, BOSS 세 종류로 구분되며, 수집하는 것만으로도 해당 종류의 코어를 높일 수 있습니다.<br><br>성물 조각을 모아 강화하면 코어와 능력치가 추가로 상승하며 강회 실패는 없습니다.<br><br><strong><em><b>",
            images:["images/성물.png"]
        },
        {
            title: "8. [전창] 쿤 마스체니 코스튬 ",
            text: "[전창] 쿤 마스체니의 신규 코스튬 ‘시티 블룸’ 9/2출시!",
            images:["images/전창.png"]
        },
        {
            title: "리랼 버프",
            text: "레볼루션 스킬 개편을 통해서 초기 의도인 적을 끌어모으는 기능과 중독의 성능을 강화<br><br>필살기 [베놈 버스트]를 사용하면 넓은 범위에 산개하고 있는 적군을 자신 앞으로 끌어당기게 됩니다.<br><br>패시브 [만독불침]으로 전투 시작 시 중독시키는 적군의 수가 증가하고 중독시킨 적군의 에너지를 감소시키는 동시에 전장에 중독시킨 적군이 있으면 자신은 에너지를 회복하게 됩니다.",
            images:["images/리랼.png"]
        },
        {
            title: "또 하나의 가능성 — [숭고한 검사] 화이트",
            text: "9/30 출시 예정<br>탈 SSR+급 사기 OP캐릭터로 낼 것이다",
            images:["images/화이트.png"]
        },
    ]
},

{
    version: "8/5",
    date: "2026-08-04",
    type: "패치",
    title: "연 이랑 스킬 및 업데이트 내용",
    new: true,
    content: [
        {
            title: "연 이랑 스킨",
            text: "패시브 - 전투 중 화상과 상태 이상에 면역되고 공격력이 증가한다. 전투 시작 시 모든 적군에게 제거할 수 없는 화상을 일으켜 매초마다 공격력의 대미지를 입힌다.자신이 스킬을 사용할 때마다 화상의 공격력 계수가 N%씩 증가한다.(중첩 제한 없음)<br><br>액티브1 - 모든 적군의 버프를 제거하고 대미지를 N회 입힌다. N초간 적중한 적군의 방어력, 물리 저항률을 감소시킨다.<br><br>모든 아군의 해로운 효과를 제거하고 체력을 회복시킨다. 자신은 생명의 불꽃 N개를 획득하고 체력이 N% 미만으로 떨어지는 대미지를 입으면 불꽃을 N개 소모하여 체력을 N% 회복한다. (최대 N개 보유 가능)<br><br>궁 - 무적 상태로 전장 중앙에 강림하여 근원의 불꽃을 터뜨리고 전투 시작 위치로 복귀한다.모든 적군에게 공격력 N%의 대미지와 대상 최대 체력 N%의 대미지를 N회 입히고 N초간 에어본시킨다.스킬 사용 중에 모든 적군의 체력 회복을 차단한다.",
            images:["images/연이랑 최종.png"]
        },
        {
            title: "콘텐츠 확장",
            text: "일반 모험 챕터 확장 (351 ~ 355F)<br>인페르노 모험 챕터 확장 (351 ~ 355F) 월요일<br>레볼루션 추가 성장"
        },
        {
            title: "이벤트",
            text: "행운의 돌림판<br>화이트의 복권<br>타워 마블<br>지옥열차 아레나 시즌 10<br>연합 토벌전 시즌 35<br>연합 협동 미션"
        },
        {
            title: "의상",
            text: "신규의상: 연 이랑<br>다시 한 번 더: 리랼, 시랼"
        }
    ]
},

{
    version: "8/5",
    date: "2026-07-31",
    type: "패치",
    title: "연 이랑 출시 및 패치",
    new: false,
    content: [
        {
            title: "신규 가주 연 이랑 출시",
            text: "패시브 - [영원의 불꽃] 효과가 발동하여 적군 전체에게 영구히 지속되는 화상을 입힙니다.<br>엑티브1 - [모든 것을 살리는 불꽃] 스킬로 아군의 모든 해로운 효과를 제거하고 체력을 회복과 무적 부여<br>엑티브2 - [모든 것을 태우는 불꽃] 스킬을 사용하여 모든 적군에게 강력한 대미지와 디버프를 부여하고 에너지까지 강탈하여 한순간에 대량의 에너지를 수급할 수 있습니다.<br>궁극기 -  [불꽃의 주인]전장 중앙에 강림하여 적의 체력 회복을 차단하고 강력한 체력 비례 대미지를 입힌다.",
            images:["images/연이랑.png"]
        },
        {
            title: "8/5 (수) 적용 사항",
            text: "타워 마블 이벤트 개편:주사위 가치 2배, 보상 2배 상향  무료 주사위 획득량 50% 감소로 동일 기대값 유지 및 피로도 절반 압축<br>오등분의 복권 이벤트: 시동무기 영혼 강화에 집중하실 수 있도록 '마스터키' 류 획득에 초점을 맞췄습니다.<br>공방 스토어(보석상) 교환 효율 상향: 레볼루션 재화 및 시동무기 영혼 강화의 접근성을 높이기 위해 획득량과 교환 횟수를 대폭 상향.",
            images:["images/보석상.png","images/보석상2.png"]
        },
        {
            title: "8/19 (수) 적용 사항",
            text: "시동무기 분해소 개선 :강화가 진행된 시동무기의 분해 기능이 추가 됩니다.<br>노랑이의 렛츠 빙고 타임: 최종 보상을 주혼의 구슬 3,000개에서 영혼 주사위 30개로 변경."
        },
        {
            title: "레볼루션 추가 성장",
            text: "해금 조건: 태생 SSR+ 등급, 가주급 동료로 모든 레볼루션 노드 강화를 완료한 캐릭터에 한해 개방됩니다.(※태생 SSR, XSR+, SR, R 등급 대상 제외)<br>성장 방식: 총 3개의 스탯 항목(관통/저항, 명중/회피, 효과 적중/효과 저항 등)을 선택하여 각 최대 10레벨까지 강화 가능.",
            images:["images/레볼.png"]
        },
        {
            title:"새로운 부유선 ‘레드 데스’ 사전 안내",
            text:"전투 시작 시 모든 아군이 녹 속성 적군에게 주는 대미지를 증가 시키고, 모든 적군의 적 속성 저항률을 감소시켜 속성을 증폭 시키는 역할을 수행해 줄 것입니다.",
            images:["images/부유선.png"]
        },
        {
            title: "[13월의 무기] 하 유리",
            text:"<strong>보스전 및 PVE 특화 핵심 딜러<strong><br>전투 스타일: '두 자루 13월의 주인'이라는 매력적인 설정에 맞춰, 검은 삼월과 초록 사월을 교체해 가며 전투한다.<br>궁극기: 무기를 교체할 때마다 고유한 '폭주' 중첩(스택)이 쌓이게 됩니다. 이후 필살기인 [13월의 폭주]를 사용하면, 누적된 중첩에 비례하여 적에게 피해를 입힌다.",
            images:["images/크유리.png"]
        },
        {
            title: "건의 사항 답변",
            text: "Q. 시동무기의 잠금, 검색, 옵션 관리 편의를 개선해 주세요.<br>A. 추가 안 할 계획이지만 UI 개선은 해주겠다.<br><br>Q. 시동무기 영혼 강화의 실패 부담과 재화 부족을 완화해 주세요.<br>A. 천장 도입은 안 해줄 것이지만 '마스터키' 공급량과 결정체 교환소의 교환 횟수를 대폭 늘려주겠다.<br><br>Q. 코어 요구치 때문에 막히는 콘텐츠의 난이도를 완화해 주세요.<br>A. 포트는 4~7만 완화 해주겠다. 인페는 이미 수정 완료.<br><br>Q. 성장 시스템의 너무 빠른 추가와 완성 비용을 낮춰 주세요.<br>A. 지속적으로 추가 공급을 늘려 꾸준히 성장하실 수 있는 환경을 만들겠습니다. 추가 성장의 출시 빈도는 좀 더 적절하게 조정할 수 있도록 노력하겠다.<br><br>Q. 코어, 기원, 레볼루션 성장 재화의 수급처를 늘려 주세요.<br>A. 다른곳에서 늘릴 계획은 없고 8/5 공방 스토어 교환량 확대를 통해 앞으로도 꾸준히 재화 공급을 지원하겠다.<br><br>Q. 신규 캐릭터 전투 메커니즘을 미리 시험할 환경을 제공해 주세요(일모는 너무 쉬워 인페 오픈까지 기다려야 하는 문제).<br>A. 기존 콘텐츠의 패턴을 급하게 바꾸기보다는, 새로운 즐길 거리이자 캐릭터 시험의 장이 될 수 있는 신규 콘텐츠를 별도로 준비하여 9월 중순에 선보이겠다.<br><br>Q. 부유선 소환의 확정성(천장)과 성장 재화 수급을 개선해 주세요.<br>A. '부유선 제작 교환소’에 [부유선] 전설 제작도 선택 상자를 추가하는 한편, 붉은 부유석을 사용해 부유선을 확정적으로 선택해 획득할 수 있게 만들겠다.<br><br>Q. PVP 매칭 조와 이벤트 시작 배치를 합리적으로 해주세요.<br>A. 9월 중순을 목표로 패치를 위해 노력중이다.<br><br>Q. 신규/기존 캐릭터 밸런스 개선해 주세요.<br>A. 켈헬람은 8월 중순, 리랼은 9월 중순에 상향<br><br>Q. 가주 복각 주기를 좀 더 자주 진행해 주세요.<br>A. 8/19 - 가드안, 9/2 - 트메",
        }
    ]
},

{
    version: "7/22",
    date: "2026-07-22",
    type: "패치",
    title: "시랼 출시 및 업데이트 내용",
    new: false,
    content: [
        {
            title: "콘텐츠 확장",
            text: "[일반] 모험 확장 (346F ~ 350F)<br>월요일 [인페르노] 모험 확장 (346F ~ 350F)<br>하드 모험 스테이지 점프 기능 추가<br>혼돈의 시련, 속성시련 시련 확장 (No. 2150)"
        },
        {
            title: "이벤트",
            text: "[3주년] 논스톱 SSR+ 한계돌파 소환 (마고까지)<br>하진성의 FUG 모집<br>참참참 이벤트<br>성장 교환 (넨 네야까지)<br>연합 함대전 시즌 10<br>연합 협동 미션<br>진검승부 시즌 9<br>타워 레이스"
        },
        {
            title: "의상",
            text: "신규 의상 등장 ( [붉은 등불] 시랼, [갯뱀의 자손] 리랼)<br>복각 의상 등장 ( [FUG의 간부] 하유라)"
        },
        {
            title: "기타 내용",
            text: "[가시] 비올레 - 레볼루션 스킬 밸런스 조정 (버프)<br>랭커 레이스 입장 조건 변경 및 보상 변경<br>  ➔ [인페르노]완등 시 입장 가능<br>"
        },
        {
            title:"시랼 스킬셋",
            text:"궁극기 화무십일홍 - 가장 멀리 있는 적군 뒤로 순간이동한 뒤 부채를 휘둘러 때린 후 넉백시킨다(스킬 사용 중 상태이상 면역).<br>액티브 비선영수 - 가장 멀리 있는 적군에게 부채를 던져 경로상 적군에게 대미지를 입힌 뒤 대상 후방으로 순간이동하며 부채를 휘둘러 대미지를 입히며 넉백시킨다(스킬 사용 중 상태이상 면역).<br>액티브 몽환향 - 연기를 일으켜 범위 내 적군의 명중과 회피를 감소시킴. 추가로 연기가 지속되는 동안 자신은 은신하며 매초마다 에너지를 회복한다.<br>패시브 - 자신의 스킬 공격이 적중한 적군을 출혈시켜 매초 공격력 N%의 대미지와 대상 최대 체력 N%의 대미지를 입힌다. (중첩 제한 없음) 전장에 출혈된 적군이 N명 이상 있다면 적군의 공격을 무조건 회피한다.",
            images:["images/16.png"]
        },
        {
            title: "레볼루션 능력",
            text:"4단계: [몽환향] 스킬이 강화되어 연기가 지속되는 동안 공격력, 급속이 증가하고 매초마다 자신의 액티브 쿨타임이 감소한다. <br>5단계: [소중유검] 스킬이 강화되어 전투 시작 시 가장 멀리 있는 적군 N명에게 출혈 디버프를 건다. 추가로 출혈 상태의 적군에게 대미지를 입힐 때마다 공격력이 증가한다. (최대 N중첩) 자신이 출혈 시킨 적군의 체력 회복을 차단한다.",
            images:["images/17.png"]
        },
        {
            title: "시동무기 능력",
            text: "LV 1 - [비선영수] 스킬 사용 시 마법 관통률이 증가한다.<br>LV 2 - [몽환향] 스킬이 강화되어 연기 안에 있는 적군의 방어력을 감소시킨다.<br>LV 3 - [몽환향] 스킬이 강화되어 연기 안에 있는 적군의 마법 저항률을 감소시킨다.<br> LV 4 - [몽환향] 스킬이 강화되어 연기 안에 있는 적군의 급속을 감소시킨다. ",
            images:["images/18.png"]
        }
    ]
},

{
version:"7/20",
date:"2026-07-20",
type:"패치",
new:false,
title:"라이브 방송",

content:[
    {
        title:"쿠폰",
        text:"TOG3YRFESTA - 성장 재화 선택상자 6H * 1000<br> 3YRTOGETHER - 마스터키 1000개<br>THANKUAD3YR - 빛레볼 1만개 <br>TOG3YRGIFT - 초록레볼 2천개<br>SHLTOG3YR - 전설 부유선 제작도 1개<br>TOG3YRUPDATE - 빛레볼 1만개<br>TOGPDGIFT - 자유의 교범서 20개<br> TOGLOVEU - 마스터키 1천개<br> TOGNEWCOS - SRR+ 탑의 축복 돌파석 60개<br> TOG3YRNEW - 암티 100장<br>TOG3YRTHANKU - 기원티켓 50장"
    
    },
    {
        title:"일정",
        text:"앞으로 이벤트에 관한 일정 설명입니다.",
        images:["images/1.png"]
    },
    {
        title:"이벤트",
        text:"논스톱 이벤트(마고까지)<br><br>성장교환(넨네야까지) + 레볼루션 초기화 티켓<br><br>스승과 제자 이벤트 시작",
        images:["images/2.jpg", 
                "images/3.png",
                "images/4.png",
                "images/5.png"]
    },
{
    title:"신규 동료 - 시랼",
    text:"전투 시작 후 가장 멀리 있는 적군에게 출혈 디버프 부여<br><br>패시브 - 적군 출혈 버프가 있으면 반드시 회피 부여<br><br>액티브1 - 적군 명중·회피 감소 및 본인 은신 + 에너지 회복<br><br>엑티브2 -  멀리 잇는 적에게 부채를 날려 순간이동 후 대상을 넉백(모든 스킬공격에 출혈효과)궁 - 가장 멀리잇는 적군에게 이동 후 넉백 및 중앙으로 모으기<br><br>출혈딜 - 체퍼뎀",
    
    images:[
        "images/6.png"
    ]
},

{
        title:"신규 가주",
        text:"신규 가주 연 이랑입니다.",
        images:["images/7.png"]
},
{
        title:"가시 비올레 버프",
        text:"7/22부터 적용입니다.",
        images:["images/8.png"]
},
{
        title:"PC클라이언트 제작중",
        text:"보안상 이유 때문에 접속 할때마다 로그인 필요.",
        images:["images/9.png"]
},
{
        title:"7/22 업데이트",
        text:"편의성, 랭커 레이스 조건 개편<br><br>연합 합동 미션에 빛레볼, 교범서 배정<br><br>콜로세움 아레나에 마스터키, 시동 주사위 배정",
        images:["images/10.png", "images/11.png"]
},
{
        title:"8/5 업데이트",
        text:"풀노드 해야지 이용 가능<br><br> 관통/저항, 명중/회피, 효적/효저 추가 강화 가능",
        images:["images/12.png"]
},
{
        title:"8/19 업데이트",
        text:"녹장어 추가",
        images:["images/13.png"]
},
{
        title:"9/2 업데이트",
        text:"트메 복각 + 버프(개구리 딜, 생존력 증가)<br><br>신규 부유선 및 시동무기 개발중",
        images:["images/14.png"]
},
{
        title:"사전 QNA 답변",
        text:"3주년 업데이트부터 지게나 보스 딜 안 들어가는 구간 완화 + 보상 획득량 상향<br><br>기가보스 참여도 비중 완화 및 보상 상향<br><br>레볼 및 코어 상시 초기화는 도입 X <br><br>인페르노 및 밥솥 코어 완화<br><br>코어 통합 안해줄거임<br><br>밥솥에 자동 재도전 구현 안 할 계획<br><br>가주 기원 좀 더 자주 할 계획<br><br>SSR 기원은 추가할 예정X<br><br>태생의 보주 교범서 획득처 증가시킬 계획<br><br>강화된 시무 분해기능 추가 예정(8/19)<br><br>신규 시동무기 추기(9/30)<br><br>부유선 천장 시스템 도입은 하지 않을 것이지만, 부유선 '확정 상자' 추가 예정<br><br> 켈헬람, 리랼 버프 예정<br><br>점령전 구조 및 보상 개편, 오락실 보상 상향<br><br>인페르노 관리자 수 낮추고 보상 압축 기획 중<br><br>고급 결정체로 마스터키, 레볼루션 재화 교환 추가<br><br>발판 버프? 하는듯<br><br>연합 꾸미기 추가<br><br>상태이상 버프, 디버프 가시성 상향<br><br>코어가 전투력 표기에 더 잘 반영되도록 패치",
},
],


}

];

const list=document.getElementById("list");

function draw(){

list.innerHTML="";

const keyword=document
.getElementById("search")
.value
.toLowerCase();

const filter=document
.getElementById("filter")
.value;

updates.forEach(update=>{

const text=
JSON.stringify(update).toLowerCase();

if(!text.includes(keyword)) return;

if(filter!="전체"&&filter!=update.type) return;

const card=document.createElement("div");

card.className="card";

card.innerHTML=`

<div class="head">

<div class="left">

<div class="version">${update.version}</div>

<div>${update.title}</div>

<div class="date">${update.date}</div>

<div class="type">${update.type}</div>

${update.new?'<div class="badge">NEW</div>':""}

</div>

<div>▼</div>

</div>


<div class="content">

${update.content.map(item => `
    <div class="update-section">

        <h3>${item.title}</h3>

        <p>${item.text}</p>

        ${
            item.images
            ? item.images.map(img =>
                `<img src="${img}" class="update-image">`
              ).join("")
            : ""
        }

    </div>
`).join("")}

`;

card.querySelector(".head").onclick=()=>{

const c=card.querySelector(".content");

c.style.display=
c.style.display=="block"
?"none":"block";

};

list.appendChild(card);

});



}

draw();

search.oninput=draw;

filter.onchange=draw;